CSI API ETABS v1
eWallPierRebarLayerType Enumeration
 The pier rebar types.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eWallPierRebarLayerType
Public Enumeration eWallPierRebarLayerType
Dim instance As eWallPierRebarLayerType
public enum class eWallPierRebarLayerType
type eWallPierRebarLayerType
Members
Member name | Value | Description
Vertical_Distributed_MiddleZone_Eachface | 1
Horizontal_Distributed_MiddleZone_Eachface | 2
Vertical_Distributed_EndZoneI_Total | 3
Vertical_Distributed_EndZoneJ_Total | 4
Confinement_EndZoneI | 5
Confinement_EndZoneJ | 6
Diagonal_Each | 7
Remarks
See Also
Reference
ETABSv1 Namespace